results/io_medium_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1053.23
    fsyncs/s:                     1397.82

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               16.46

General statistics:
    total time:                          10.0631s
    total number of events:              24156

Latency (ms):
         min:                                    0.01
         avg:                                    1.66
         max:                                  804.40
         95th percentile:                        0.12
         sum:                                40175.24

Threads fairness:
    events (avg/stddev):           6039.0000/727.86
    execution time (avg/stddev):   10.0438/0.01


time taken - 10511.059814453125