results/io_medium_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     978.84
    fsyncs/s:                     1291.17

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               15.29

General statistics:
    total time:                          10.1128s
    total number of events:              22447

Latency (ms):
         min:                                    0.01
         avg:                                    1.78
         max:                                  815.46
         95th percentile:                        0.13
         sum:                                40042.29

Threads fairness:
    events (avg/stddev):           5611.7500/295.89
    execution time (avg/stddev):   10.0106/0.02


time taken - 40138.685791015625