results/io_native_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      247.01
    writes/s:                     165.33
    fsyncs/s:                     616.35

Throughput:
    read, MiB/s:                  3.86
    written, MiB/s:               2.58

General statistics:
    total time:                          10.1846s
    total number of events:              9454

Latency (ms):
         min:                                    0.00
         avg:                                    8.52
         max:                                 1209.18
         95th percentile:                       50.11
         sum:                                80591.46

Threads fairness:
    events (avg/stddev):           1181.7500/12.14
    execution time (avg/stddev):   10.0739/0.03