results/io_native_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     69.55
    fsyncs/s:                     186.30

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1.09

General statistics:
    total time:                          10.0635s
    total number of events:              1551

Latency (ms):
         min:                                    0.01
         avg:                                   51.66
         max:                                 1988.48
         95th percentile:                      235.74
         sum:                                80128.83

Threads fairness:
    events (avg/stddev):           193.8750/28.55
    execution time (avg/stddev):   10.0161/0.00